package 线程;

/**
 * @author chenjie
 * @date 2021/5/27-10:01
 */
public class Demo {
    /*
    * 程序(program)       一个固定的运行逻辑和数据的集合
    * 进程(process)  一个正在运行的程序
    * 线程(thread)  一条独立的独立路径
    * */

    /*
    *  一个线程就是一个执行通道
    * */

    /*
    * 并行: parallel
    *  多个任务同时运行。在某个确定的时刻，
    *
    * 并发 concurrent
    *   多个任务（进程，线程）同时发起，不能同时执行的，只能是同时要求执行，就只能在某个时间片内，
    * 将多个任务都有过执行，一个cpu在不同的任务之间，来回切换。只不过每个任务耗费的时间比较短，
    * cpu的切换速度比较快，所以可以让用户感觉就像多个任务在同时执行
    * */

    /*
    * 多线程程序都是并发，不是并行
    * */

    public static void main(String[] args) {

    }


}
