package hashmap;

/**
 * @author chenjie
 * @date 2021/6/3-19:15
 */
public class Demo {
    /*
    * HashMap:
    *       数组结构、链表、红黑树
    *   存储 ： 存储东西，数据结构是用来存储东西的。。实际就是内存
    *   put
    *   get
    *
    * 数组：采用一段连续的存储单元来存储数据
    *   时间复杂度  查询 o(1)        // 1 表示简单  N 表示复杂
    *              删除插入 o(N)    // 插入删除需要该索引序号
    *
    * 链表：一种物理存储单元上 非连续，非顺序的存储单元
    *           删除插入 o(1)
    *           查询 o(N)
    *
    * 数据结构 + 算法 = 程序
    * 系统 =  服务 + 存储
    *
    * HashMap算法：
    *   哈希算法
    *       也叫散列。就是把任意长度（Key）通过散列算法变换成固定长度Key（地址），通过在这个地址进行访问的数据结构
    * JDK8红黑树
    * */

}
